Revit 2024 API
BuiltInFailures.AutoRouteFailures.ElementHasFlowCalculation Property
 This element has an open connection. This may not be an error, but for flow calculations to work correctly all connections should be sealed with an end cap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementHasFlowCalculation { get; }
Visual Basic
Public Shared ReadOnly Property ElementHasFlowCalculation As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementHasFlowCalculation {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace